In [1]:
import pandas as pd

In [2]:
data = {
    'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales': [200, 120, 340, 124, 243, 350]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [6]:
by_company = df.groupby('Company')

In [7]:
by_company.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [8]:
by_company.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [9]:
by_company.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [10]:
by_company.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [13]:
sum = by_company.sum()

In [14]:
sum

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [15]:
sum.loc['FB']

Sales    593
Name: FB, dtype: int64

In [16]:
sum.xs('Sales', axis=1)

Company
FB      593
GOOG    320
MSFT    464
Name: Sales, dtype: int64

In [20]:
sum.loc['Company']

KeyError: 'Company'

In [22]:
sum.info();

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, FB to MSFT
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sales   3 non-null      int64
dtypes: int64(1)
memory usage: 128.0+ bytes

In [23]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [26]:
df.groupby('Company').sum()

         Sales  sum
Company
FB         593  0.0
GOOG       320  0.0
MSFT       464  0.0

In [27]:
df.drop('sum')

KeyError: "['sum'] not found in axis"

In [28]:
df

  Company   Person  Sales  sum
0    GOOG      Sam    200  NaN
1    GOOG  Charlie    120  NaN
2    MSFT      Amy    340  NaN
3    MSFT  Vanessa    124  NaN
4      FB     Carl    243  NaN
5      FB    Sarah    350  NaN

In [32]:
df = df.drop(['sum'],axis=1)

In [33]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [34]:
df['Sum'] = df['Sales']

In [35]:
df

  Company   Person  Sales  Sum
0    GOOG      Sam    200  200
1    GOOG  Charlie    120  120
2    MSFT      Amy    340  340
3    MSFT  Vanessa    124  124
4      FB     Carl    243  243
5      FB    Sarah    350  350

In [42]:
df.loc[0].loc['Sum'] = df.groupby('Company').sum().loc['GOOG'].loc['Sum']

C:\Installations\anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)
C:\Installations\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [43]:
df

  Company   Person  Sales  Sum
0    GOOG      Sam    200  200
1    GOOG  Charlie    120  120
2    MSFT      Amy    340  340
3    MSFT  Vanessa    124  124
4      FB     Carl    243  243
5      FB    Sarah    350  350

In [44]:
df.groupby('Company').count()

         Person  Sales  Sum
Company
FB            2      2    2
GOOG          2      2    2
MSFT          2      2    2

In [45]:
df.groupby('Company').max()

          Person  Sales  Sum
Company
FB         Sarah    350  350
GOOG         Sam    200  200
MSFT     Vanessa    340  340

In [46]:
df.groupby('Company').min()

          Person  Sales  Sum
Company
FB          Carl    243  243
GOOG     Charlie    120  120
MSFT         Amy    124  124

In [49]:
df.groupby('Company').describe()

        Sales                                                           Sum  \
        count   mean         std    min     25%    50%     75%    max count
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0   2.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0   2.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0   2.0


          mean         std    min     25%    50%     75%    max
Company
FB       296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG     160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT     232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [50]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000
Sum   count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000